{
  "Apple___Apple_scab": {
    "en": " <b>Crop</b>: Apple <br/>Disease: Apple Scab<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Apple scab overwinters primarily in fallen leaves and in the soil. Disease development is favored by wet, cool weather that generally occurs in spring and early summer.\n\n        <br/> 2. Fungal spores are carried by wind, rain or splashing water from the ground to flowers, leaves or fruit. During damp or rainy periods, newly opening apple leaves are extremely susceptible to infection. The longer the leaves remain wet, the more severe the infection will be. Apple scab spreads rapidly between 55-75 degrees Fahrenheit.\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Choose resistant varieties when possible.\n\n        <br/>2. Rake under trees and destroy infected leaves to reduce the number of fungal spores available to start the disease cycle over again next spring\n        \n        <br/>3. Water in the evening or early morning hours (avoid overhead irrigation) to give the leaves time to dry out before infection can occur.\n        <br/>4. Spread a 3- to 6-inch layer of compost under trees, keeping it away from the trunk, to cover soil and prevent splash dispersal of the fungal spores.",
    "hi": " <b>फसल</b>: सेब <br/>रोग: सेब पर पपड़ी<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. सेब की पपड़ी मुख्य रूप से गिरी हुई पत्तियों और मिट्टी में सर्दियों में रहती है। रोग के विकास को गीले, ठंडे मौसम से बढ़ावा मिलता है जो आम तौर पर वसंत और गर्मियों की शुरुआत में होता है।\n\n        <br/> 2. फफूंद के बीजाणु हवा, बारिश या जमीन से पानी के छींटों द्वारा फूलों, पत्तियों या फलों तक पहुंच जाते हैं। नमी या बरसात के समय में, सेब की नई खिलने वाली पत्तियाँ संक्रमण के प्रति अत्यधिक संवेदनशील होती हैं। जितनी अधिक देर तक पत्तियाँ गीली रहेंगी, संक्रमण उतना अधिक गंभीर होगा। सेब का स्कैब 55-75 डिग्री फ़ारेनहाइट के बीच तेजी से फैलता है।\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. जब संभव हो प्रतिरोधी किस्में चुनें.\n\n        <br/>2. अगले वसंत में रोग चक्र को फिर से शुरू करने के लिए उपलब्ध कवक बीजाणुओं की संख्या को कम करने के लिए पेड़ों के नीचे रेक लगाएं और संक्रमित पत्तियों को नष्ट कर दें\n        \n        <br/>3. संक्रमण होने से पहले पत्तियों को सूखने का समय देने के लिए शाम या सुबह के समय पानी दें (ऊपर से सिंचाई करने से बचें)।\n        <br/>4. पेड़ों के नीचे खाद की 3 से 6 इंच की परत फैलाएं, इसे तने से दूर रखें, ताकि मिट्टी ढक जाए और फफूंद के बीजाणुओं को फैलने से रोका जा सके।"
  },
  "Apple___Black_rot": {
    "en": " <b>Crop</b>: Apple <br/>Disease: Black Rot<br/>\n        <br/> Cause of disease:\n\n        <br/><br/>Black rot is caused by the fungus Diplodia seriata (syn Botryosphaeria obtusa).The fungus can infect dead tissue as well as living trunks, branches, leaves and fruits. In wet weather, spores are released from these infections and spread by wind or splashing water. The fungus infects leaves and fruit through natural openings or minor wounds.\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Prune out dead or diseased branches.\n\n        <br/>2. Prune out dead or diseased branches.\n        \n        <br/>3. Remove infected plant material from the area.\n        <br/>4. Remove infected plant material from the area.\n        <br/>5. Be sure to remove the stumps of any apple trees you cut down. Dead stumps can be a source of spores.",
    "hi": " <b>फसल</b>: सेब <br/>रोग: काला सड़न<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/>काला सड़न कवक डिप्लोडिया सेरीटा (syn botryosphaeria obtusa) के कारण होता है। कवक मृत ऊतकों के साथ-साथ जीवित तनों, शाखाओं, पत्तियों और फलों को भी संक्रमित कर सकता है। गीले मौसम में, इन संक्रमणों से बीजाणु निकलते हैं और हवा या पानी के छींटों से फैलते हैं। कवक प्राकृतिक छिद्रों या छोटे घावों के माध्यम से पत्तियों और फलों को संक्रमित करता है।\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. मृत या रोगग्रस्त शाखाओं को छाँटें।\n\n        <br/>2. मृत या रोगग्रस्त शाखाओं को छाँटें।\n        \n        <br/>3. क्षेत्र से संक्रमित पौधे सामग्री को हटा दें।\n        <br/>4. क्षेत्र से संक्रमित पौधे सामग्री को हटा दें।\n        <br/>5. आपके द्वारा काटे गए किसी भी सेब के पेड़ के ठूंठ को हटाना सुनिश्चित करें। मृत स्टंप बीजाणुओं का स्रोत हो सकते हैं।"
  },
  "Apple___Cedar_apple_rust": {
    "en": " <b>Crop</b>: Apple <br/>Disease: Cedar Apple Rust<br/>\n        <br/> Cause of disease:\n\n        <br/><br/>Cedar apple rust (Gymnosporangium juniperi-virginianae) is a fungal disease that depends on two species to spread and develop. It spends a portion of its two-year life cycle on Eastern red cedar (Juniperus virginiana). The pathogen’s spores develop in late fall on the juniper as a reddish brown gall on young branches of the trees.\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Since the juniper galls are the source of the spores that infect the apple trees, cutting them is a sound strategy if there aren’t too many of them.\n\n        <br/>2. While the spores can travel for miles, most of the ones that could infect your tree are within a few hundred feet.\n        \n        <br/>3. The best way to do this is to prune the branches about 4-6 inches below the galls.",
    "hi": " <b>फसल</b>: सेब <br/>रोग: देवदार सेब जंग<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/>सीडर एप्पल रस्ट (जिमनोस्पोरैंगियम जुनिपेरी-वर्जिनियाना) एक कवक रोग है जो फैलने और विकसित होने के लिए दो प्रजातियों पर निर्भर करता है। यह अपने दो साल के जीवन चक्र का एक हिस्सा पूर्वी लाल देवदार (जूनिपरस वर्जिनियाना) पर बिताता है। रोगज़नक़ के बीजाणु जुनिपर पर देर से शरद ऋतु में पेड़ों की युवा शाखाओं पर लाल भूरे रंग के पित्त के रूप में विकसित होते हैं।\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. चूँकि जुनिपर गॉल उन बीजाणुओं का स्रोत हैं जो सेब के पेड़ों को संक्रमित करते हैं, यदि उनमें से बहुत अधिक न हों तो उन्हें काटना एक अच्छी रणनीति है।\n\n        <br/>2. जबकि बीजाणु मीलों तक यात्रा कर सकते हैं, अधिकांश बीजाणु जो आपके पेड़ को संक्रमित कर सकते हैं वे कुछ सौ फीट के दायरे में होते हैं।\n        \n        <br/>3. ऐसा करने का सबसे अच्छा तरीका यह है कि शाखाओं को गॉल से लगभग 4-6 इंच नीचे से काट दिया जाए।"
  },
  "Apple___healthy": {
    "en": " <b>Crop</b>: Apple <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: सेब <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Blueberry___healthy": {
    "en": " <b>Crop</b>: Blueberry <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: ब्लूबेरी <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Cherry_(including_sour)___Powdery_mildew": {
    "en": " <b>Crop</b>: Cherry <br/>Disease: Powdery Mildew<br/>\n        <br/> Cause of disease:\n\n        <br/><br/>Podosphaera clandestina, a fungus that most commonly infects young, expanding leaves but can also be found on buds, fruit and fruit stems. It overwinters as small, round, black bodies (chasmothecia) on dead leaves, on the orchard floor, or in tree crotches. Colonies produce more (asexual) spores generally around shuck fall and continue the disease cycle.\n\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Remove and destroy sucker shoots.\n\n        <br/>2. Keep irrigation water off developing fruit and leaves by using irrigation that does not wet the leaves. Also, keep irrigation sets as short as possible.\n        \n        <br/>3. Follow cultural practices that promote good air circulation, such as pruning, and moderate shoot growth through judicious nitrogen management.",
    "hi": " <b>फसल</b>: चेरी <br/>रोग: ख़स्ता फफूंदी<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/>पोडोस्फेरा क्लैंडेस्टिना, एक कवक जो आमतौर पर युवा, विस्तारित पत्तियों को संक्रमित करता है लेकिन कलियों, फलों और फलों के तनों पर भी पाया जा सकता है। यह मृत पत्तियों पर, बगीचे के फर्श पर, या पेड़ की शाखाओं पर छोटे, गोल, काले शरीर (चैस्मोथेसिया) के रूप में सर्दियों में रहता है। आमतौर पर झाड़ियाँ गिरने के आसपास कालोनियाँ अधिक (अलैंगिक) बीजाणु उत्पन्न करती हैं और रोग चक्र को जारी रखती हैं।\n\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. चूसने वाले अंकुरों को निकालें और नष्ट करें।\n\n        <br/>2. सिंचाई के पानी को फलों और पत्तियों के विकास से दूर रखें, ऐसी सिंचाई का उपयोग करें जिससे पत्तियाँ गीली न हों। इसके अलावा, सिंचाई सेट को यथासंभव छोटा रखें।\n        \n        <br/>3. सांस्कृतिक प्रथाओं का पालन करें जो अच्छे वायु परिसंचरण को बढ़ावा देते हैं, जैसे कि छंटाई, और विवेकपूर्ण नाइट्रोजन प्रबंधन के माध्यम से शूट की मध्यम वृद्धि।"
  },
  "Cherry_(including_sour)___healthy": {
    "en": " <b>Crop</b>: Cherry <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: चेरी <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": {
    "en": " <b>Crop</b>: Corn <br/>Disease: Grey Leaf Spot<br/>\n        <br/> Cause of disease:\n\n        <br/><br/>Gray leaf spot lesions on corn leaves hinder photosynthetic activity, reducing carbohydrates allocated towards grain fill. The extent to which gray leaf spot damages crop yields can be estimated based on the extent to which leaves are infected relative to grainfill. Damage can be more severe when developing lesions progress past the ear leaf around pollination time.\tBecause a decrease in functioning leaf area limits photosynthates dedicated towards grainfill, the plant might mobilize more carbohydrates from the stalk to fill kernels.\n\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. In order to best prevent and manage corn grey leaf spot, the overall approach is to reduce the rate of disease growth and expansion.\n\n        <br/>2. This is done by limiting the amount of secondary disease cycles and protecting leaf area from damage until after corn grain formation.\n        \n        <br/>3. High risk factors for grey leaf spot in corn: <br/>\n                    a.\tSusceptible hybrid\n                    b.\tContinuous corn\n                    c.\tLate planting date\n                    d.\tMinimum tillage systems\n                    e.\tField history of severe disease\n                    f.\tEarly disease activity (before tasseling)\n                    g.\tIrrigation\n                    h.\tFavorable weather forecast for disease.",
    "hi": " <b>फसल</b>: मकई <br/>रोग: ग्रे लीफ स्पॉट<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/>मकई की पत्तियों पर भूरे पत्तों के धब्बे के घाव प्रकाश संश्लेषक गतिविधि में बाधा डालते हैं, जिससे अनाज भरने के लिए आवंटित कार्बोहाइड्रेट कम हो जाते हैं। ग्रे पत्ती का धब्बा फसल की पैदावार को किस हद तक नुकसान पहुंचाता है, इसका अनुमान अनाज के भराव के सापेक्ष पत्तियों के संक्रमित होने की सीमा के आधार पर लगाया जा सकता है। क्षति अधिक गंभीर हो सकती है जब परागण के समय के आसपास विकसित घाव कान की पत्ती से आगे बढ़ जाते हैं।\tक्योंकि कामकाजी पत्ती क्षेत्र में कमी से अनाज भरने के लिए समर्पित प्रकाश संश्लेषण सीमित हो जाता है, पौधा गुठली भरने के लिए डंठल से अधिक कार्बोहाइड्रेट जुटा सकता है।\n\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. मकई के भूरे पत्तों वाले धब्बे को सर्वोत्तम तरीके से रोकने और प्रबंधित करने के लिए, समग्र दृष्टिकोण रोग की वृद्धि और विस्तार की दर को कम करना है।\n\n        <br/>2. यह द्वितीयक रोग चक्रों की मात्रा को सीमित करके और मकई के दाने बनने के बाद तक पत्ती क्षेत्र को क्षति से बचाकर किया जाता है।\n        \n        <br/>3. मक्के में भूरे पत्तों के धब्बे के लिए उच्च जोखिम कारक: <br/>\n                    एक।\tअतिसंवेदनशील संकर\n                    बी।\tलगातार मक्का\n                    सी।\tदेर से रोपण की तारीख\n                    डी।\tन्यूनतम जुताई प्रणाली\n                    ई.\tगंभीर बीमारी का क्षेत्र इतिहास\n                    एफ।\tप्रारंभिक रोग गतिविधि (टासलिंग से पहले)\n                    जी।\tसिंचाई\n                    एच।\tरोग के लिए अनुकूल मौसम का पूर्वानुमान।"
  },
  "Corn_(maize)___Common_rust_": {
    "en": " <b>Crop</b>: Corn(maize) <br/>Disease: Common Rust<br/>\n        <br/> Cause of disease:\n\n        <br/><br/>Common corn rust, caused by the fungus Puccinia sorghi, is the most frequently occurring of the two primary rust diseases of corn in the U.S., but it rarely causes significant yield losses in Ohio field (dent) corn. Occasionally field corn, particularly in the southern half of the state, does become severely affected when weather conditions favor the development and spread of rust fungus\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Although rust is frequently found on corn in Ohio, very rarely has there been a need for fungicide applications. This is due to the fact that there are highly resistant field corn hybrids available and most possess some degree of resistance.\n\n        <br/>2. However, popcorn and sweet corn can be quite susceptible. In seasons where considerable rust is present on the lower leaves prior to silking and the weather is unseasonably cool and wet, an early fungicide application may be necessary for effective disease control. Numerous fungicides are available for rust control. ",
    "hi": " <b>फसल</b>: मक्का (मक्का) <br/>रोग: सामान्य जंग<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/>सामान्य मकई रतुआ, जो पुकिनिया सोरघी कवक के कारण होता है, यू.एस. में मकई के दो प्राथमिक रतुआ रोगों में से सबसे अधिक बार होने वाली बीमारी है, लेकिन यह शायद ही कभी ओहियो क्षेत्र (डेंट) मकई में महत्वपूर्ण उपज हानि का कारण बनता है। कभी-कभी खेत का मक्का, विशेष रूप से राज्य के दक्षिणी हिस्से में, गंभीर रूप से प्रभावित हो जाता है जब मौसम की स्थिति जंग कवक के विकास और प्रसार के लिए अनुकूल होती है\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. हालाँकि ओहायो में मकई पर जंग अक्सर पाई जाती है, लेकिन कवकनाशी अनुप्रयोगों की आवश्यकता बहुत कम होती है। यह इस तथ्य के कारण है कि अत्यधिक प्रतिरोधी क्षेत्रीय मकई संकर उपलब्ध हैं और अधिकांश में कुछ हद तक प्रतिरोध होता है।\n\n        <br/>2. हालाँकि, पॉपकॉर्न और स्वीट कॉर्न काफी संवेदनशील हो सकते हैं। ऐसे मौसमों में जहां रेशम बनने से पहले निचली पत्तियों पर काफी जंग मौजूद होती है और मौसम बेमौसम ठंडा और गीला होता है, प्रभावी रोग नियंत्रण के लिए प्रारंभिक कवकनाशी का उपयोग आवश्यक हो सकता है। जंग नियंत्रण के लिए अनेक कवकनाशी उपलब्ध हैं। "
  },
  "Corn_(maize)___Northern_Leaf_Blight": {
    "en": " <b>Crop</b>: Corn(maize) <br/>Disease: Northern Leaf Blight\n        <br/>\n        <br/> Cause of disease:\n\n        <br/><br/>Northern corn leaf blight (NCLB) is a foliar disease of corn (maize) caused by Exserohilum turcicum, the anamorph of the ascomycete Setosphaeria turcica. With its characteristic cigar-shaped lesions, this disease can cause significant yield loss in susceptible corn hybrids.\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Management of NCLB can be achieved primarily by using hybrids with resistance, but because resistance may not be complete or may fail, it is advantageous to utilize an integrated approach with different cropping practices and fungicides.\n\n        <br/>2. Scouting fields and monitoring local conditions is vital to control this disease.",
    "hi": " <b>फसल</b>: मक्का (मक्का) <br/>रोग: उत्तरी पत्ती का झुलसा\n        <br/>\n        <br/> रोग का कारण:\n\n        <br/><br/>नॉर्दर्न कॉर्न लीफ ब्लाइट (एनसीएलबी) मकई (मक्का) का एक पत्तेदार रोग है, जो एक्ससेरोहिलम टरसिकम, एस्कोमाइसीट सेटोस्फेरिया टरिका के एनामॉर्फ के कारण होता है। अपने विशिष्ट सिगार के आकार के घावों के साथ, यह रोग अतिसंवेदनशील मकई संकरों में महत्वपूर्ण उपज हानि का कारण बन सकता है।\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. एनसीएलबी का प्रबंधन मुख्य रूप से प्रतिरोध के साथ संकर का उपयोग करके प्राप्त किया जा सकता है, लेकिन क्योंकि प्रतिरोध पूर्ण नहीं हो सकता है या विफल हो सकता है, विभिन्न फसल प्रथाओं और कवकनाशी के साथ एक एकीकृत दृष्टिकोण का उपयोग करना फायदेमंद है।\n\n        <br/>2. इस बीमारी को नियंत्रित करने के लिए खेतों की निगरानी करना और स्थानीय परिस्थितियों की निगरानी करना महत्वपूर्ण है।"
  },
  "Grape___Black_rot": {
    "en": " <b>Crop</b>: Grape <br/>Disease: Black Rot<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. The black rot fungus overwinters in canes, tendrils, and leaves on the grape vine and on the ground. Mummified berries on the ground or those that are still clinging to the vines become the major infection source the following spring.\n\n        <br/> 2. During rain, microscopic spores (ascospores) are shot out of numerous, black fruiting bodies (perithecia) and are carried by air currents to young, expanding leaves. In the presence of moisture, these spores germinate in 36 to 48 hours and eventually penetrate the leaves and fruit stems. \n\n        <br/> 3. The infection becomes visible after 8 to 25 days. When the weather is wet, spores can be released the entire spring and summer providing continuous infection.\n\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Space vines properly and choose a planting site where the vines will be exposed to full sun and good air circulation. Keep the vines off the ground and insure they are properly tied, limiting the amount of time the vines remain wet thus reducing infection.\n\n        <br/>2. Keep the fruit planting and surrounding areas free of weeds and tall grass. This practice will promote lower relative humidity and rapid drying of vines and thereby limit fungal infection.\n        \n        <br/>3. Use protective fungicide sprays. Pesticides registered to protect the developing new growth include copper, captan, ferbam, mancozeb, maneb, triadimefon, and ziram. Important spraying times are as new shoots are 2 to 4 inches long, and again when they are 10 to 15 inches long, just before bloom, just after bloom, and when the fruit has set.",
    "hi": " <b>फसल</b>: अंगूर <br/>रोग: काला सड़न<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. ब्लैक रॉट फंगस बेंत, टेंड्रिल और अंगूर की बेल पर पत्तियों और जमीन पर सर्दियों में रहता है। ज़मीन पर ममीकृत जामुन या जो अभी भी लताओं से चिपके हुए हैं, अगले वसंत में प्रमुख संक्रमण स्रोत बन जाते हैं।\n\n        <br/> 2. बारिश के दौरान, सूक्ष्म बीजाणु (एस्कोस्पोर्स) असंख्य, काले फलने वाले पिंडों (पेरिथेसिया) से बाहर निकल जाते हैं और वायु धाराओं द्वारा युवा, विस्तारित पत्तियों तक ले जाए जाते हैं। नमी की उपस्थिति में, ये बीजाणु 36 से 48 घंटों में अंकुरित होते हैं और अंततः पत्तियों और फलों के तनों में प्रवेश कर जाते हैं। \n\n        <br/> 3. संक्रमण 8 से 25 दिनों के बाद दिखाई देने लगता है। जब मौसम गीला होता है, तो बीजाणु पूरे वसंत और गर्मियों में लगातार संक्रमण प्रदान करते हुए निकल सकते हैं।\n\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. बेलों को ठीक से जगह दें और एक रोपण स्थल चुनें जहां बेलें पूर्ण सूर्य और अच्छे वायु परिसंचरण के संपर्क में होंगी। बेलों को ज़मीन से दूर रखें और सुनिश्चित करें कि वे ठीक से बंधी हुई हैं, बेलों के गीले रहने की मात्रा को सीमित करें जिससे संक्रमण कम हो।\n\n        <br/>2. फलों के रोपण और आसपास के क्षेत्रों को खरपतवार और लंबी घास से मुक्त रखें। यह अभ्यास कम सापेक्ष आर्द्रता और बेलों के तेजी से सूखने को बढ़ावा देगा और इस तरह फंगल संक्रमण को सीमित करेगा।\n        \n        <br/>3. सुरक्षात्मक कवकनाशी स्प्रे का प्रयोग करें। विकासशील नई वृद्धि की सुरक्षा के लिए पंजीकृत कीटनाशकों में कॉपर, कैप्टान, फ़र्बम, मैन्कोज़ेब, मानेब, ट्रायडाइमफ़ोन और ज़िरम शामिल हैं। छिड़काव का समय महत्वपूर्ण है क्योंकि नए अंकुर 2 से 4 इंच लंबे होते हैं, और फिर जब वे 10 से 15 इंच लंबे होते हैं, खिलने से ठीक पहले, खिलने के तुरंत बाद, और जब फल सेट हो जाता है।"
  },
  "Corn_(maize)___healthy": {
    "en": " <b>Crop</b>: Corn(maize) <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: मक्का (मक्का) <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Grape___Esca_(Black_Measles)": {
    "en": " <b>Crop</b>: Grape <br/>Disease: Black Measles<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Black Measles is caused by a complex of fungi that includes several species of Phaeoacremonium, primarily by P. aleophilum (currently known by the name of its sexual stage, Togninia minima), and by Phaeomoniella chlamydospora.\n\n        <br/> 2. The overwintering structures that produce spores (perithecia or pycnidia, depending on the pathogen) are embedded in diseased woody parts of vines. The overwintering structures that produce spores (perithecia or pycnidia, depending on the pathogen) are embedded in diseased woody parts of vines.\n\n        <br/> 3. During fall to spring rainfall, spores are released and wounds made by dormant pruning provide infection sites.\n\n        <br/> 4. Wounds may remain susceptible to infection for several weeks after pruning with susceptibility declining over time.\n\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Post-infection practices (sanitation and vine surgery) for use in diseased, mature vineyards are not as effective and are far more costly than adopting preventative practices (delayed pruning, double pruning, and applications of pruning-wound protectants) in young vineyards. \n\n\n        <br/>2. Sanitation and vine surgery may help maintain yields. In spring, look for dead spurs or for stunted shoots. Later in summer, when there is a reduced chance of rainfall, practice good sanitation by cutting off these cankered portions of the vine beyond the canker, to where wood appears healthy. Then remove diseased, woody debris from the vineyard and destroy it.\n        \n        <br/>3. The fungicides labeled as pruning-wound protectants, consider using alternative materials, such as a wound sealant with 5 percent boric acid in acrylic paint (Tech-Gro B-Lock), which is effective against Eutypa dieback and Esca, or an essential oil (Safecoat VitiSeal).",
    "hi": " <b>फसल</b>: अंगूर <br/>रोग: काला खसरा<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. काला खसरा कवक के एक समूह के कारण होता है जिसमें फियोएक्रेमोनियम की कई प्रजातियां शामिल हैं, मुख्य रूप से पी. एलेओफिलम (वर्तमान में इसके यौन चरण, टोगिनिया मिनिमा के नाम से जाना जाता है), और फियोमोनिएला क्लैमाइडोस्पोरा द्वारा।\n\n        <br/> 2. ओवरविन्टरिंग संरचनाएं जो बीजाणु (पेरीथेसिया या पाइक्निडिया, रोगज़नक़ के आधार पर) उत्पन्न करती हैं, लताओं के रोगग्रस्त लकड़ी वाले हिस्सों में अंतर्निहित होती हैं। ओवरविन्टरिंग संरचनाएं जो बीजाणु (पेरीथेसिया या पाइक्निडिया, रोगज़नक़ के आधार पर) पैदा करती हैं, लताओं के रोगग्रस्त लकड़ी वाले हिस्सों में अंतर्निहित होती हैं।\n\n        <br/> 3. पतझड़ से वसंत ऋतु की वर्षा के दौरान, बीजाणु निकलते हैं और सुप्त छंटाई द्वारा बने घाव संक्रमण स्थल प्रदान करते हैं।\n\n        <br/> 4. छंटाई के बाद घाव कई हफ्तों तक संक्रमण के प्रति संवेदनशील बने रह सकते हैं और समय के साथ संवेदनशीलता कम हो जाती है।\n\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. रोगग्रस्त, परिपक्व अंगूर के बागों में उपयोग के लिए संक्रमण के बाद की प्रथाएं (स्वच्छता और बेल की सर्जरी) उतनी प्रभावी नहीं हैं और युवा अंगूर के बागों में निवारक प्रथाओं (विलंबित छंटाई, दोहरी छंटाई, और छंटाई-घाव रक्षक के अनुप्रयोग) को अपनाने की तुलना में कहीं अधिक महंगी हैं। \n\n\n        <br/>2. स्वच्छता और बेल सर्जरी से पैदावार बनाए रखने में मदद मिल सकती है। वसंत ऋतु में, मृत स्पर्स या रुके हुए अंकुरों की तलाश करें। बाद में गर्मियों में, जब वर्षा की संभावना कम हो जाती है, तो बेल के इन कैंकर वाले हिस्सों को कैंकर से परे, जहां लकड़ी स्वस्थ दिखाई देती है, काटकर अच्छी स्वच्छता का अभ्यास करें। फिर अंगूर के बगीचे से रोगग्रस्त, लकड़ी के मलबे को हटा दें और उसे नष्ट कर दें।\n        \n        <br/>3. प्रूनिंग-घाव रक्षक के रूप में लेबल किए गए कवकनाशी, वैकल्पिक सामग्रियों का उपयोग करने पर विचार करते हैं, जैसे ऐक्रेलिक पेंट (टेक-ग्रो बी-लॉक) में 5 प्रतिशत बोरिक एसिड के साथ घाव सीलेंट, जो यूटाइपा डाइबैक और एस्का, या एक आवश्यक तेल (सेफकोट विटीसील) के खिलाफ प्रभावी है।"
  },
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": {
    "en": "<b> Crop</b> : Grape <br/> Disease: Leaf Spot",
    "hi": "<b> फसल</b> : अंगूर <br/> रोग: पत्ती धब्बा"
  },
  "Grape___healthy": {
    "en": " <b>Crop</b>: Grape <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: अंगूर <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Orange___Haunglongbing_(Citrus_greening)": {
    "en": " <b>Crop</b>: Orange <br/>Disease: Citrus Greening<br/>\n        <br/> Cause of disease:\n\n        <br/><br/>  Huanglongbing (HLB) or citrus greening is the most severe citrus disease, currently devastating the citrus industry worldwide. The presumed causal bacterial agent Candidatus Liberibacter spp. affects tree health as well as fruit development, ripening and quality of citrus fruits and juice.\n\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. In regions where disease incidence is low, the most common practices are avoiding the spread of infection by removal of symptomatic trees, protecting grove edges through intensive monitoring, use of pesticides, and biological control of the vector ACP.\n\n        <br/>2. According to Singerman and Useche (2016), CHMAs coordinate insecticide application to control the ACP spreading across area-wide neighboring commercial citrus groves as part of a plan to address the HLB disease.\n        \n        <br/>3. In addition to foliar nutritional sprays, plant growth regulators were tested, unsuccessfully, to reduce HLB-associated fruit drop (Albrigo and Stover, 2015).",
    "hi": " <b>फसल</b>: नारंगी <br/>रोग: साइट्रस ग्रीनिंग<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> हुआंगलोंगबिंग (एचएलबी) या साइट्रस ग्रीनिंग सबसे गंभीर साइट्रस रोग है, जो वर्तमान में दुनिया भर में साइट्रस उद्योग को तबाह कर रहा है। अनुमानित कारण जीवाणु एजेंट कैंडिडैटस लाइबेरिबैक्टर एसपीपी। पेड़ों के स्वास्थ्य के साथ-साथ फलों के विकास, पकने और खट्टे फलों और रस की गुणवत्ता को प्रभावित करता है।\n\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. उन क्षेत्रों में जहां रोग की घटना कम है, सबसे आम प्रथा रोगसूचक पेड़ों को हटाकर संक्रमण के प्रसार से बचना है, गहन निगरानी के माध्यम से पेड़ों के किनारों की रक्षा करना, कीटनाशकों का उपयोग करना और वेक्टर एसीपी का जैविक नियंत्रण करना है।\n\n        <br/>2. सिंगरमैन और यूशे (2016) के अनुसार, सीएचएमए एचएलबी रोग को संबोधित करने की योजना के हिस्से के रूप में क्षेत्र-व्यापी पड़ोसी वाणिज्यिक साइट्रस पेड़ों में फैले एसीपी को नियंत्रित करने के लिए कीटनाशक अनुप्रयोग का समन्वय करते हैं।\n        \n        <br/>3. पत्ते पर पोषण संबंधी स्प्रे के अलावा, एचएलबी से जुड़े फलों के गिरने को कम करने के लिए पौधों के विकास नियामकों का असफल परीक्षण किया गया (अल्ब्रिगो और स्टोवर, 2015)।"
  },
  "Peach___Bacterial_spot": {
    "en": " <b>Crop</b>: Peach <br/>Disease: Bacterial Spot<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. The disease is caused by four species of Xanthomonas (X. euvesicatoria, X. gardneri, X. perforans, and X. vesicatoria). In North Carolina, X. perforans is the predominant species associated with bacterial spot on tomato and X. euvesicatoria is the predominant species associated with the disease on pepper.\n\n        <br/> 2. All four bacteria are strictly aerobic, gram-negative rods with a long whip-like flagellum (tail) that allows them to move in water, which allows them to invade wet plant tissue and cause infection.\n\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. The most effective management strategy is the use of pathogen-free certified seeds and disease-free transplants to prevent the introduction of the pathogen into greenhouses and field production areas. Inspect plants very carefully and reject infected transplants- including your own!\n\n        <br/>2. In transplant production greenhouses, minimize overwatering and handling of seedlings when they are wet.\n        \n        <br/>3. Trays, benches, tools, and greenhouse structures should be washed and sanitized between seedlings crops.\n        <br/>4. Do not spray, tie, harvest, or handle wet plants as that can spread the disease.",
    "hi": " <b>फसल</b>: आड़ू <br/>रोग: बैक्टीरियल स्पॉट<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. यह रोग ज़ैंथोमोनास की चार प्रजातियों (एक्स. यूवेसिकटोरिया, एक्स. गार्डनेरी, एक्स. पेरफोरन्स, और एक्स. वेसिकटोरिया) के कारण होता है। उत्तरी कैरोलिना में, एक्स. पेरफोरन्स टमाटर पर बैक्टीरिया के धब्बे से जुड़ी प्रमुख प्रजाति है और एक्स. यूवेसिकटोरिया काली मिर्च पर इस बीमारी से जुड़ी प्रमुख प्रजाति है।\n\n        <br/> 2. सभी चार बैक्टीरिया पूरी तरह से एरोबिक, ग्राम-नकारात्मक छड़ें हैं जिनमें एक लंबी चाबुक जैसी फ्लैगेलम (पूंछ) होती है जो उन्हें पानी में चलने की अनुमति देती है, जो उन्हें गीले पौधे के ऊतकों पर आक्रमण करने और संक्रमण पैदा करने की अनुमति देती है।\n\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. सबसे प्रभावी प्रबंधन रणनीति ग्रीनहाउस और क्षेत्र उत्पादन क्षेत्रों में रोगज़नक़ की शुरूआत को रोकने के लिए रोगज़नक़ मुक्त प्रमाणित बीज और रोग मुक्त प्रत्यारोपण का उपयोग है। पौधों का बहुत सावधानी से निरीक्षण करें और संक्रमित प्रत्यारोपणों को अस्वीकार कर दें - जिसमें आपका अपना भी शामिल है!\n\n        <br/>2. प्रत्यारोपण उत्पादन वाले ग्रीनहाउस में, अधिक पानी देना और पौधों के गीले होने पर उन्हें संभालना कम से कम करें।\n        \n        <br/>3. रोपाई वाली फसलों के बीच ट्रे, बेंच, उपकरण और ग्रीनहाउस संरचनाओं को धोया और साफ किया जाना चाहिए।\n        <br/>4. गीले पौधों पर स्प्रे न करें, बांधें, कटाई न करें या उन्हें संभालें नहीं क्योंकि इससे बीमारी फैल सकती है।"
  },
  "Pepper,_bell___Bacterial_spot": {
    "en": " <b>Crop</b>: Pepper <br/>Disease: Bacterial Spot<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Bacterial spot is caused by several species of gram-negative bacteria in the genus Xanthomonas.\n\n        <br/> 2. In culture, these bacteria produce yellow, mucoid colonies. A \"mass\" of bacteria can be observed oozing from a lesion by making a cross-sectional cut through a leaf lesion, placing the tissue in a droplet of water, placing a cover-slip over the sample, and examining it with a microscope (~200X)..\n        \n        \n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. The primary management strategy of bacterial spot begins with use of certified pathogen-free seed and disease-free transplants.\n\n        <br/>2. The bacteria do not survive well once host material has decayed, so crop rotation is recommended. Once the bacteria are introduced into a field or greenhouse, the disease is very difficult to control.\n        \n        <br/>3. Pepper plants are routinely sprayed with copper-containing bactericides to maintain a \"protective\" cover on the foliage and fruit.",
    "hi": " <b>फसल</b>: काली मिर्च <br/>रोग: जीवाणु धब्बा<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. बैक्टीरियल स्पॉट जीनस ज़ैंथोमोनास में ग्राम-नेगेटिव बैक्टीरिया की कई प्रजातियों के कारण होता है।\n\n        <br/> 2. संस्कृति में, ये जीवाणु पीले, श्लेष्मा कालोनियों का निर्माण करते हैं। पत्ती के घाव के माध्यम से एक क्रॉस-अनुभागीय कट बनाकर, ऊतक को पानी की एक बूंद में रखकर, नमूने के ऊपर एक कवर-स्लिप रखकर, और एक माइक्रोस्कोप (~ 200X) के साथ इसकी जांच करके बैक्टीरिया के एक \"द्रव्यमान\" को घाव से निकलते हुए देखा जा सकता है।\n        \n        \n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. बैक्टीरियल स्पॉट की प्राथमिक प्रबंधन रणनीति प्रमाणित रोगज़नक़-मुक्त बीज और रोग-मुक्त प्रत्यारोपण के उपयोग से शुरू होती है।\n\n        <br/>2. एक बार मेजबान सामग्री के सड़ जाने के बाद बैक्टीरिया अच्छी तरह से जीवित नहीं रह पाते हैं, इसलिए फसल चक्र की सिफारिश की जाती है। एक बार जब बैक्टीरिया किसी खेत या ग्रीनहाउस में पहुंच जाते हैं, तो बीमारी को नियंत्रित करना बहुत मुश्किल होता है।\n        \n        <br/>3. पत्ते और फल पर \"सुरक्षात्मक\" आवरण बनाए रखने के लिए काली मिर्च के पौधों पर नियमित रूप से तांबा युक्त जीवाणुनाशकों का छिड़काव किया जाता है।"
  },
  "Peach___healthy": {
    "en": " <b>Crop</b>: Peach <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: आड़ू <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Pepper,_bell___healthy": {
    "en": " <b>Crop</b>: Pepper <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: काली मिर्च <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Potato___healthy": {
    "en": " <b>Crop</b>: Potato <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: आलू <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Raspberry___healthy": {
    "en": " <b>Crop</b>: Raspberry <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: रास्पबेरी <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Soybean___healthy": {
    "en": " <b>Crop</b>: Soyabean <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: सोयाबीन <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Strawberry___healthy": {
    "en": " <b>Crop</b>: Strawberry <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: स्ट्रॉबेरी <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Tomato___healthy": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: No disease<br/>\n\n        <br/><br/> Don't worry. Your crop is healthy. Keep it up !!!",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: कोई रोग नहीं<br/>\n\n        <br/><br/> चिंता मत करो। आपकी फसल स्वस्थ है. इसे जारी रखो !!!"
  },
  "Potato___Early_blight": {
    "en": " <b>Crop</b>: Potato <br/>Disease: Early Blight<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Early blight (EB) is a disease of potato caused by the fungus Alternaria solani. It is found wherever potatoes are grown. \n\n        <br/> 2. The disease primarily affects leaves and stems, but under favorable weather conditions, and if left uncontrolled, can result in considerable defoliation and enhance the chance for tuber infection. Premature defoliation may lead to considerable reduction in yield.\n\n        <br/> 3. Primary infection is difficult to predict since EB is less dependent upon specific weather conditions than late blight.\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Plant only diseasefree, certified seed. \n\n        <br/>2. Follow a complete and regular foliar fungicide spray program.\n        \n        <br/>3. Practice good killing techniques to lessen tuber infections.\n        <br/>4. Allow tubers to mature before digging, dig when vines are dry, not wet, and avoid excessive wounding of potatoes during harvesting and handling.",
    "hi": " <b>फसल</b>: आलू <br/>रोग: अगेती झुलसा<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. अगेती ब्लाइट (ईबी) आलू का एक रोग है जो अल्टरनेरिया सोलानी कवक के कारण होता है। यह वहां पाया जाता है जहां आलू उगाए जाते हैं। \n\n        <br/> 2. यह रोग मुख्य रूप से पत्तियों और तनों को प्रभावित करता है, लेकिन अनुकूल मौसम की स्थिति में, और अगर इसे अनियंत्रित छोड़ दिया जाए, तो इसके परिणामस्वरूप काफी हद तक पत्तियां गिर सकती हैं और कंद संक्रमण की संभावना बढ़ सकती है। समय से पहले पत्ते गिरने से उपज में काफी कमी आ सकती है।\n\n        <br/> 3. प्राथमिक संक्रमण की भविष्यवाणी करना मुश्किल है क्योंकि ईबी लेट ब्लाइट की तुलना में विशिष्ट मौसम की स्थिति पर कम निर्भर है।\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. केवल रोगमुक्त, प्रमाणित बीज ही बोयें। \n\n        <br/>2. संपूर्ण और नियमित पर्ण कवकनाशी स्प्रे कार्यक्रम का पालन करें।\n        \n        <br/>3. कंद संक्रमण को कम करने के लिए अच्छी हत्या तकनीकों का अभ्यास करें।\n        <br/>4. खुदाई से पहले कंदों को परिपक्व होने दें, जब बेलें सूखी हों, तब खुदाई करें, गीली न हों, और कटाई और रख-रखाव के दौरान आलू को अत्यधिक चोट लगने से बचाएं।"
  },
  "Potato___Late_blight": {
    "en": " <b>Crop</b>: Potato <br/>Disease: Late Blight<br/>\n\n        Late blight is a potentially devastating disease of potato, infecting leaves, stems and fruits of plants. The disease spreads quickly in fields and can result in total crop failure if untreated. Late blight of potato was responsible for the Irish potato famine of the late 1840s.              \n        <br/> Cause of disease:\n\n        <br/><br/> 1. Late blight is caused by the oomycete Phytophthora infestans. Oomycetes are fungus-like organisms also called water molds, but they are not true fungi.\n\n        <br/> 2. There are many different strains of P. infestans. These are called clonal lineages and designated by a number code (i.e. US-23). Many clonal lineages affect both tomato and potato, but some lineages are specific to one host or the other.\n        <br/> 3. The host range is typically limited to potato and tomato, but hairy nightshade (Solanum physalifolium) is a closely related weed that can readily become infected and may contribute to disease spread. Under ideal conditions, such as a greenhouse, petunia also may become infected.\n        \n        \n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Seed infection is unlikely on commercially prepared tomato seed or on saved seed that has been thoroughly dried.\n\n        <br/>2. Inspect tomato transplants for late blight symptoms prior to purchase and/or planting, as tomato transplants shipped from southern regions may be infected\n        \n        <br/>3. If infection is found in only a few plants within a field, infected plants should be removed, disced-under, killed with herbicide or flame-killed to avoid spreading through the entire field.",
    "hi": " <b>फसल</b>: आलू <br/>रोग: पिछेती झुलसा<br/>\n\n        लेट ब्लाइट आलू की एक संभावित विनाशकारी बीमारी है, जो पौधों की पत्तियों, तनों और फलों को संक्रमित करती है। यह बीमारी खेतों में तेजी से फैलती है और अगर इलाज न किया जाए तो फसल पूरी तरह बर्बाद हो सकती है। 1840 के दशक के अंत में आयरिश आलू के अकाल के लिए आलू की पछेती तुषार जिम्मेदार थी।              \n        <br/> रोग का कारण:\n\n        <br/><br/> 1. लेट ब्लाइट ओमीसीट फाइटोफ्थोरा इन्फेस्टैन्स के कारण होता है। ओमीसाइकेट्स कवक जैसे जीव हैं जिन्हें जल साँचे भी कहा जाता है, लेकिन वे सच्चे कवक नहीं हैं।\n\n        <br/> 2. पी. इन्फेस्टैन्स के कई अलग-अलग उपभेद हैं। इन्हें क्लोनल वंशावली कहा जाता है और एक संख्या कोड (यानी यूएस-23) द्वारा निर्दिष्ट किया जाता है। कई क्लोनल वंशावली टमाटर और आलू दोनों को प्रभावित करती हैं, लेकिन कुछ वंशावली एक मेजबान या दूसरे के लिए विशिष्ट होती हैं।\n        <br/> 3. मेजबान सीमा आम तौर पर आलू और टमाटर तक सीमित होती है, लेकिन बालों वाली नाइटशेड (सोलनम फिसालिफोलियम) एक निकट संबंधी खरपतवार है जो आसानी से संक्रमित हो सकती है और बीमारी फैलाने में योगदान दे सकती है। आदर्श परिस्थितियों में, जैसे कि ग्रीनहाउस, पेटुनिया भी संक्रमित हो सकता है।\n        \n        \n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. व्यावसायिक रूप से तैयार किए गए टमाटर के बीज या अच्छी तरह से सुखाए गए सहेजे गए बीज पर बीज संक्रमण की संभावना नहीं है।\n\n        <br/>2. खरीद और/या रोपण से पहले पिछेती झुलसा के लक्षणों के लिए टमाटर के प्रत्यारोपण का निरीक्षण करें, क्योंकि दक्षिणी क्षेत्रों से भेजे गए टमाटर के प्रत्यारोपण संक्रमित हो सकते हैं\n        \n        <br/>3. यदि किसी खेत में केवल कुछ ही पौधों में संक्रमण पाया जाता है, तो पूरे खेत में फैलने से रोकने के लिए संक्रमित पौधों को हटा देना चाहिए, काट देना चाहिए, शाकनाशी से मार देना चाहिए या आग से जला देना चाहिए।"
  },
  "Squash___Powdery_mildew": {
    "en": " <b>Crop</b>: Squash <br/>Disease: Powdery mildew<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Powdery mildew infections favor humid conditions with temperatures around 68-81° F\n\n        <br/> 2. In warm, dry conditions, new spores form and easily spread the disease.\n        <br/> 3. Symptoms of powdery mildew first appear mid to late summer in Minnesota.  The older leaves are more susceptible and powdery mildew will infect them first.\n        <br/> 4. Wind blows spores produced in leaf spots to infect other leaves.\n        <br/> 5. Under favorable conditions, powdery mildew can spread very rapidly, often covering all of the leaves.\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Apply fertilizer based on soil test results. Avoid over-applying nitrogen.\n\n        <br/>2. Provide good air movement around plants through proper spacing, staking of plants and weed control.\n        \n        <br/>3. Once a week, examine five mature leaves for powdery mildew infection. In large plantings, repeat at 10 different locations in the field.\n        <br/>4. If susceptible varieties are growing in an area where powdery mildew has resulted in yield loss in the past, fungicide may be necessary.",
    "hi": " <b>फसल</b>: स्क्वैश <br/>रोग: ख़स्ता फफूंदी<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. ख़स्ता फफूंदी संक्रमण 68-81° फ़ारेनहाइट के तापमान के साथ आर्द्र स्थितियों को अनुकूल बनाता है\n\n        <br/> 2. गर्म, शुष्क परिस्थितियों में, नए बीजाणु बनते हैं और रोग आसानी से फैलते हैं।\n        <br/> 3. ख़स्ता फफूंदी के लक्षण सबसे पहले मिनेसोटा में गर्मियों के मध्य से अंत तक दिखाई देते हैं।  पुरानी पत्तियाँ अधिक संवेदनशील होती हैं और ख़स्ता फफूंदी उन्हें सबसे पहले संक्रमित करेगी।\n        <br/> 4. हवा पत्ती के धब्बों में उत्पन्न बीजाणुओं को उड़ाकर अन्य पत्तियों को संक्रमित कर देती है।\n        <br/> 5. अनुकूल परिस्थितियों में, ख़स्ता फफूंदी बहुत तेजी से फैल सकती है, जो अक्सर सभी पत्तियों को कवर कर लेती है।\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. मृदा परीक्षण के परिणाम के आधार पर उर्वरक का प्रयोग करें। नाइट्रोजन के अधिक प्रयोग से बचें।\n\n        <br/>2. उचित दूरी, पौधों की कटाई और खरपतवार नियंत्रण के माध्यम से पौधों के चारों ओर अच्छी हवा की आवाजाही प्रदान करें।\n        \n        <br/>3. सप्ताह में एक बार, ख़स्ता फफूंदी संक्रमण के लिए पाँच परिपक्व पत्तियों की जाँच करें। बड़े पौधों में, खेत में 10 अलग-अलग स्थानों पर दोहराएं।\n        <br/>4. यदि अतिसंवेदनशील किस्में ऐसे क्षेत्र में उग रही हैं जहां पाउडर फफूंदी के कारण अतीत में उपज में कमी आई है, तो कवकनाशी आवश्यक हो सकता है।"
  },
  "Strawberry___Leaf_scorch": {
    "en": " <b>Crop</b>: Strawberry <br/>Disease: Leaf Scorch<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Scorched strawberry leaves are caused by a fungal infection which affects the foliage of strawberry plantings. The fungus responsible is called Diplocarpon earliana.\n\n        <br/> 2. Strawberries with leaf scorch may first show signs of issue with the development of small purplish blemishes that occur on the topside of leaves.\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Since this fungal pathogen over winters on the fallen leaves of infect plants, proper garden sanitation is key.\n\n        <br/>2. This includes the removal of infected garden debris from the strawberry patch, as well as the frequent establishment of new strawberry transplants.\n        \n        <br/>3. The avoidance of waterlogged soil and frequent garden cleanup will help to reduce the likelihood of spread of this fungus.",
    "hi": " <b>फसल</b>: स्ट्रॉबेरी <br/>रोग: पत्ती झुलसा<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. झुलसी हुई स्ट्रॉबेरी की पत्तियां एक फंगल संक्रमण के कारण होती हैं जो स्ट्रॉबेरी के पौधों की पत्तियों को प्रभावित करती हैं। जिम्मेदार कवक को डिप्लोकार्पोन इयरलियाना कहा जाता है।\n\n        <br/> 2. पत्ती झुलसने वाली स्ट्रॉबेरी में सबसे पहले पत्तियों के ऊपरी भाग पर छोटे-छोटे बैंगनी रंग के धब्बे विकसित होने से समस्या के लक्षण दिखाई दे सकते हैं।\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. चूंकि यह कवक रोगज़नक़ सर्दियों में संक्रमित पौधों की गिरी हुई पत्तियों पर रहता है, इसलिए बगीचे की उचित स्वच्छता महत्वपूर्ण है।\n\n        <br/>2. इसमें स्ट्रॉबेरी पैच से संक्रमित बगीचे के मलबे को हटाने के साथ-साथ नए स्ट्रॉबेरी प्रत्यारोपण की लगातार स्थापना शामिल है।\n        \n        <br/>3. जलयुक्त मिट्टी से बचने और बगीचे की बार-बार सफाई करने से इस कवक के फैलने की संभावना को कम करने में मदद मिलेगी।"
  },
  "Tomato___Bacterial_spot": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Bacterial Spot<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. The disease is caused by four species of Xanthomonas (X. euvesicatoria, X. gardneri, X. perforans, and X. vesicatoria). In North Carolina, X. perforans is the predominant species associated with bacterial spot on tomato and X. euvesicatoria is the predominant species associated with the disease on pepper.\n\n        <br/> 2. All four bacteria are strictly aerobic, gram-negative rods with a long whip-like flagellum (tail) that allows them to move in water, which allows them to invade wet plant tissue and cause infection.\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. The most effective management strategy is the use of pathogen-free certified seeds and disease-free transplants to prevent the introduction of the pathogen into greenhouses and field production areas. Inspect plants very carefully and reject infected transplants- including your own!\n\n        <br/>2. In transplant production greenhouses, minimize overwatering and handling of seedlings when they are wet.\n        \n        <br/>3. Trays, benches, tools, and greenhouse structures should be washed and sanitized between seedlings crops.\n        <br/>4. Do not spray, tie, harvest, or handle wet plants as that can spread the disease",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: जीवाणु धब्बा<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. यह रोग ज़ैंथोमोनास की चार प्रजातियों (एक्स. यूवेसिकटोरिया, एक्स. गार्डनेरी, एक्स. पेरफोरन्स, और एक्स. वेसिकटोरिया) के कारण होता है। उत्तरी कैरोलिना में, एक्स. पेरफोरन्स टमाटर पर बैक्टीरिया के धब्बे से जुड़ी प्रमुख प्रजाति है और एक्स. यूवेसिकटोरिया काली मिर्च पर इस बीमारी से जुड़ी प्रमुख प्रजाति है।\n\n        <br/> 2. सभी चार बैक्टीरिया पूरी तरह से एरोबिक, ग्राम-नकारात्मक छड़ें हैं जिनमें एक लंबी चाबुक जैसी फ्लैगेलम (पूंछ) होती है जो उन्हें पानी में चलने की अनुमति देती है, जो उन्हें गीले पौधे के ऊतकों पर आक्रमण करने और संक्रमण पैदा करने की अनुमति देती है।\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. सबसे प्रभावी प्रबंधन रणनीति ग्रीनहाउस और क्षेत्र उत्पादन क्षेत्रों में रोगज़नक़ की शुरूआत को रोकने के लिए रोगज़नक़ मुक्त प्रमाणित बीज और रोग मुक्त प्रत्यारोपण का उपयोग है। पौधों का बहुत सावधानी से निरीक्षण करें और संक्रमित प्रत्यारोपणों को अस्वीकार कर दें - जिसमें आपका अपना भी शामिल है!\n\n        <br/>2. प्रत्यारोपण उत्पादन वाले ग्रीनहाउस में, अधिक पानी देना और पौधों के गीले होने पर उन्हें संभालना कम से कम करें।\n        \n        <br/>3. रोपाई वाली फसलों के बीच ट्रे, बेंच, उपकरण और ग्रीनहाउस संरचनाओं को धोया और साफ किया जाना चाहिए।\n        <br/>4. गीले पौधों पर स्प्रे न करें, बांधें, कटाई न करें या उन्हें संभालें नहीं क्योंकि इससे बीमारी फैल सकती है"
  },
  "Tomato___Early_blight": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Early Blight<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Early blight can be caused by two different closely related fungi, Alternaria tomatophila and Alternaria solani.\n        <br/> 2. Alternaria tomatophila is more virulent on tomato than A. solani, so in regions where A. tomatophila is found, it is the primary cause of early blight on tomato. However, if A.tomatophila is absent, A.solani will cause early blight on tomato.\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Use pathogen-free seed, or collect seed only from disease-free plants..\n\n        <br/>2. Rotate out of tomatoes and related crops for at least two years.\n        \n        <br/>3. Control susceptible weeds such as black nightshade and hairy nightshade, and volunteer tomato plants throughout the rotation.\n        <br/>4. Fertilize properly to maintain vigorous plant growth. Particularly, do not over-fertilize with potassium and maintain adequate levels of both nitrogen and phosphorus.\n        <br/>5. Avoid working in plants when they are wet from rain, irrigation, or dew.\n        <br/>6. Use drip irrigation instead of overhead irrigation to keep foliage dry.",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: अगेती झुलसा<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. अगेती झुलसा दो अलग-अलग निकट संबंधी कवक, अल्टरनेरिया टोमैटोफिला और अल्टरनेरिया सोलानी के कारण हो सकता है।\n        <br/> 2. अल्टरनेरिया टोमैटोफिला टमाटर पर ए. सोलानी की तुलना में अधिक विषैला होता है, इसलिए उन क्षेत्रों में जहां ए. टोमैटोफिला पाया जाता है, यह टमाटर पर शुरुआती झुलसा रोग का प्राथमिक कारण है। हालाँकि, यदि ए.टमाटोफिला अनुपस्थित है, तो ए.सोलानी टमाटर पर शीघ्र झुलसा रोग का कारण बनेगा।\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. रोगज़नक़-मुक्त बीज का उपयोग करें, या केवल रोग-मुक्त पौधों से बीज एकत्र करें।\n\n        <br/>2. कम से कम दो वर्षों के लिए टमाटर और संबंधित फसलों का परित्याग करें।\n        \n        <br/>3. काली नाइटशेड और बालों वाली नाइटशेड जैसे संवेदनशील खरपतवारों और पूरे चक्र में स्वयंसेवी टमाटर के पौधों को नियंत्रित करें।\n        <br/>4. पौधों की जोरदार वृद्धि को बनाए रखने के लिए उचित रूप से खाद डालें। विशेष रूप से, पोटेशियम की अधिक मात्रा न डालें और नाइट्रोजन और फास्फोरस दोनों का पर्याप्त स्तर बनाए रखें।\n        <br/>5. जब पौधे बारिश, सिंचाई या ओस से गीले हों तो उनमें काम करने से बचें।\n        <br/>6. पत्तियों को सूखा रखने के लिए ऊपरी सिंचाई के बजाय ड्रिप सिंचाई का प्रयोग करें।"
  },
  "Tomato___Late_blight": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Late Blight<br/>\n\n        Late blight is a potentially devastating disease of tomato, infecting leaves, stems and fruits of plants. The disease spreads quickly in fields and can result in total crop failure if untreated.              \n        <br/> Cause of disease:\n\n        <br/><br/> 1. Late blight is caused by the oomycete Phytophthora infestans. Oomycetes are fungus-like organisms also called water molds, but they are not true fungi.\n\n        <br/> 2. There are many different strains of P. infestans. These are called clonal lineages and designated by a number code (i.e. US-23). Many clonal lineages affect both tomato and potato, but some lineages are specific to one host or the other.\n        <br/> 3. The host range is typically limited to potato and tomato, but hairy nightshade (Solanum physalifolium) is a closely related weed that can readily become infected and may contribute to disease spread. Under ideal conditions, such as a greenhouse, petunia also may become infected.",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: पिछेती झुलसा<br/>\n\n        लेट ब्लाइट टमाटर की एक संभावित विनाशकारी बीमारी है, जो पौधों की पत्तियों, तनों और फलों को संक्रमित करती है। यह बीमारी खेतों में तेजी से फैलती है और अगर इलाज न किया जाए तो फसल पूरी तरह बर्बाद हो सकती है।              \n        <br/> रोग का कारण:\n\n        <br/><br/> 1. लेट ब्लाइट ओमीसीट फाइटोफ्थोरा इन्फेस्टैन्स के कारण होता है। ओमीसाइकेट्स कवक जैसे जीव हैं जिन्हें जल साँचे भी कहा जाता है, लेकिन वे सच्चे कवक नहीं हैं।\n\n        <br/> 2. पी. इन्फेस्टैन्स के कई अलग-अलग उपभेद हैं। इन्हें क्लोनल वंशावली कहा जाता है और एक संख्या कोड (यानी यूएस-23) द्वारा निर्दिष्ट किया जाता है। कई क्लोनल वंशावली टमाटर और आलू दोनों को प्रभावित करती हैं, लेकिन कुछ वंशावली एक मेजबान या दूसरे के लिए विशिष्ट होती हैं।\n        <br/> 3. मेजबान सीमा आम तौर पर आलू और टमाटर तक सीमित होती है, लेकिन बालों वाली नाइटशेड (सोलनम फिसालिफोलियम) एक निकट संबंधी खरपतवार है जो आसानी से संक्रमित हो सकती है और बीमारी फैलाने में योगदान दे सकती है। आदर्श परिस्थितियों में, जैसे कि ग्रीनहाउस, पेटुनिया भी संक्रमित हो सकता है।"
  },
  "Tomato___Leaf_Mold": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Leaf Mold<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Leaf mold is caused by the fungus Passalora fulva (previously called Fulvia fulva or Cladosporium fulvum). It is not known to be pathogenic on any plant other than tomato.\n\n        <br/> 2. Leaf spots grow together and turn brown. Leaves wither and die but often remain attached to the plant.\n        <br/> 3. Fruit infections start as a smooth black irregular area on the stem end of the fruit. As the disease progresses, the infected area becomes sunken, dry and leathery.\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Use drip irrigation and avoid watering foliage.\n\n        <br/>2. Space plants to provide good air movement between rows and individual plants.\n        \n        <br/>3. Stake, string or prune to increase airflow in and around the plant.\n        <br/>4. Sterilize stakes, ties, trellises etc. with 10 percent household bleach or commercial sanitizer.\n        <br/>5. Circulate air in greenhouses or tunnels with vents and fans and by rolling up high tunnel sides to reduce humidity around plants.\n        <br/>6. Keep night temperatures in greenhouses higher than outside temperatures to avoid dew formation on the foliage.\n        <br/>7. Remove crop residue at the end of the season. Burn it or bury it away from tomato production areas.",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: पत्ती फफूंद<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. लीफ मोल्ड फंगस पासलोरा फुलवा (जिसे पहले फुल्विया फुलवा या क्लैडोस्पोरियम फुलवम कहा जाता था) के कारण होता है। टमाटर के अलावा किसी अन्य पौधे पर इसके रोगजनक होने की जानकारी नहीं है।\n\n        <br/> 2. पत्ती के धब्बे एक साथ बढ़ते हैं और भूरे हो जाते हैं। पत्तियाँ मुरझाकर मर जाती हैं लेकिन अक्सर पौधे से जुड़ी रहती हैं।\n        <br/> 3. फलों में संक्रमण फल के तने के सिरे पर चिकने काले अनियमित क्षेत्र के रूप में शुरू होता है। जैसे-जैसे बीमारी बढ़ती है, संक्रमित क्षेत्र धँसा, सूखा और चमड़े जैसा हो जाता है।\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. ड्रिप सिंचाई का प्रयोग करें और पत्तों को पानी देने से बचें।\n\n        <br/>2. पंक्तियों और व्यक्तिगत पौधों के बीच अच्छी हवा की आवाजाही प्रदान करने के लिए अंतरिक्ष संयंत्र।\n        \n        <br/>3. पौधे में और उसके आस-पास हवा का प्रवाह बढ़ाने के लिए स्टेक, स्ट्रिंग या प्रून।\n        <br/>4. 10 प्रतिशत घरेलू ब्लीच या वाणिज्यिक सैनिटाइज़र के साथ दांव, टाई, जाली आदि को कीटाणुरहित करें।\n        <br/>5. पौधों के चारों ओर नमी को कम करने के लिए ग्रीनहाउस या सुरंगों में वेंट और पंखों के साथ हवा प्रसारित करें और सुरंग के ऊंचे किनारों को रोल करें।\n        <br/>6. पत्तों पर ओस बनने से बचने के लिए ग्रीनहाउस में रात का तापमान बाहरी तापमान से अधिक रखें।\n        <br/>7. मौसम के अंत में फसल अवशेष हटा दें। इसे जला दें या टमाटर उत्पादन क्षेत्रों से दूर गाड़ दें।"
  },
  "Tomato___Septoria_leaf_spot": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Leaf Spot<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> Septoria leaf spot is caused by a fungus, Septoria lycopersici. It is one of the most destructive diseases of tomato foliage and is particularly severe in areas where wet, humid weather persists for extended periods.\n\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Remove diseased leaves.\n\n        <br/>2. Improve air circulation around the plants.\n        \n        <br/>3. Mulch around the base of the plants\n        <br/>4. Do not use overhead watering.\n        <br/>5. Use fungicidal sprayes.",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: पत्ती धब्बा<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> सेप्टोरिया लीफ स्पॉट एक कवक, सेप्टोरिया लाइकोपर्सिसि के कारण होता है। यह टमाटर के पत्तों की सबसे विनाशकारी बीमारियों में से एक है और विशेष रूप से उन क्षेत्रों में गंभीर है जहां गीला, आर्द्र मौसम लंबे समय तक बना रहता है।\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. रोगग्रस्त पत्तियों को हटा दें.\n\n        <br/>2. पौधों के चारों ओर वायु परिसंचरण में सुधार करें।\n        \n        <br/>3. पौधों के आधार के चारों ओर गीली घास डालें\n        <br/>4. ओवरहेड वॉटरिंग का प्रयोग न करें।\n        <br/>5. कवकनाशी स्प्रे का प्रयोग करें।"
  },
  "Tomato___Spider_mites Two-spotted_spider_mite": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Two-spotted spider mite<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. The two-spotted spider mite is the most common mite species that attacks vegetable and fruit crops.\n\n        <br/> 2. They have up to 20 generations per year and are favored by excess nitrogen and dry and dusty conditions.\n        <br/> 3. Outbreaks are often caused by the use of broad-spectrum insecticides which interfere with the numerous natural enemies that help to manage mite populations. \n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Avoid early season, broad-spectrum insecticide applications for other pests.\n\n        <br/>2. Do not over-fertilize\n        \n        <br/>3. Overhead irrigation or prolonged periods of rain can help reduce populations.",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: दो-धब्बेदार मकड़ी घुन<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. दो-धब्बेदार मकड़ी घुन सबसे आम घुन प्रजाति है जो सब्जियों और फलों की फसलों पर हमला करती है।\n\n        <br/> 2. उनकी प्रति वर्ष 20 पीढ़ियाँ होती हैं और वे अतिरिक्त नाइट्रोजन और सूखी और धूल भरी परिस्थितियों के पक्षधर हैं।\n        <br/> 3. प्रकोप अक्सर व्यापक-स्पेक्ट्रम कीटनाशकों के उपयोग के कारण होता है जो कई प्राकृतिक दुश्मनों के साथ हस्तक्षेप करते हैं जो घुन की आबादी को प्रबंधित करने में मदद करते हैं। \n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. अन्य कीटों के लिए शुरुआती सीज़न, व्यापक स्पेक्ट्रम कीटनाशकों के प्रयोग से बचें।\n\n        <br/>2. अधिक खाद न डालें\n        \n        <br/>3. ओवरहेड सिंचाई या लंबे समय तक बारिश से आबादी कम करने में मदद मिल सकती है।"
  },
  "Tomato___Target_Spo": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Target Spot<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. The fungus causes plants to lose their leaves; it is a major disease. If infection occurs before the fruit has developed, yields are low.\n\n        <br/> 2. This is a common disease on tomato in Pacific island countries. The disease occurs in the screen house and in the field.\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Remove a few branches from the lower part of the plants to allow better airflow at the base\n\n        <br/>2. Remove and burn the lower leaves as soon as the disease is seen, especially after the lower fruit trusses have been picked.\n        \n        <br/>3. Keep plots free from weeds, as some may be hosts of the fungus.\n        <br/>4. Do not use overhead irrigation; otherwise, it will create conditions for spore production and infection.",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: लक्ष्य स्थान<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. कवक के कारण पौधे अपनी पत्तियाँ खो देते हैं; यह एक बड़ी बीमारी है. यदि फल विकसित होने से पहले संक्रमण होता है, तो पैदावार कम होती है।\n\n        <br/> 2. प्रशांत द्वीप देशों में टमाटर पर यह एक आम बीमारी है। यह रोग स्क्रीन हाउस तथा खेत में होता है।\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. आधार पर बेहतर वायु प्रवाह की अनुमति देने के लिए पौधों के निचले हिस्से से कुछ शाखाएँ हटा दें\n\n        <br/>2. जैसे ही रोग दिखाई दे, निचली पत्तियों को हटा दें और जला दें, विशेषकर निचले फलों के डंठल तोड़ने के बाद।\n        \n        <br/>3. भूखंडों को खरपतवारों से मुक्त रखें, क्योंकि कुछ भाग कवक के मेजबान हो सकते हैं।\n        <br/>4. ओवरहेड सिंचाई का उपयोग न करें; अन्यथा, यह बीजाणु उत्पादन और संक्रमण के लिए स्थितियाँ पैदा करेगा।"
  },
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Yellow Leaf Curl Virus<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. TYLCV is transmitted by the insect vector Bemisia tabaci in a persistent-circulative nonpropagative manner. The virus can be efficiently transmitted during the adult stages.\n\n        <br/> 2. This virus transmission has a short acquisition access period of 15–20 minutes, and latent period of 8–24 hours.\n        <br/><br/> How to prevent/cure the disease <br/>\n        <br/>1. Currently, the most effective treatments used to control the spread of TYLCV are insecticides and resistant crop varieties.\n\n        <br/>2. The effectiveness of insecticides is not optimal in tropical areas due to whitefly resistance against the insecticides; therefore, insecticides should be alternated or mixed to provide the most effective treatment against virus transmission.\n        \n        <br/>3. Other methods to control the spread of TYLCV include planting resistant/tolerant lines, crop rotation, and breeding for resistance of TYLCV. As with many other plant viruses, one of the most promising methods to control TYLCV is the production of transgenic tomato plants resistant to TYLCV.",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: पीली पत्ती मोड़ने वाला वायरस<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. टीवाईएलसीवी कीट वेक्टर बेमिसिया टैबासी द्वारा लगातार-परिसंचारी गैर-प्रचारक तरीके से प्रसारित होता है। वयस्क अवस्था के दौरान वायरस को कुशलतापूर्वक प्रसारित किया जा सकता है।\n\n        <br/> 2. इस वायरस ट्रांसमिशन में 15-20 मिनट की छोटी अधिग्रहण अवधि और 8-24 घंटे की गुप्त अवधि होती है।\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n        <br/>1. वर्तमान में, टीवाईएलसीवी के प्रसार को नियंत्रित करने के लिए उपयोग किए जाने वाले सबसे प्रभावी उपचार कीटनाशक और प्रतिरोधी फसल किस्में हैं।\n\n        <br/>2. कीटनाशकों के प्रति सफेद मक्खी के प्रतिरोध के कारण उष्णकटिबंधीय क्षेत्रों में कीटनाशकों की प्रभावशीलता इष्टतम नहीं है; इसलिए, वायरस संचरण के खिलाफ सबसे प्रभावी उपचार प्रदान करने के लिए कीटनाशकों को वैकल्पिक रूप से या मिश्रित किया जाना चाहिए।\n        \n        <br/>3. टीवाईएलसीवी के प्रसार को नियंत्रित करने के अन्य तरीकों में प्रतिरोधी/सहिष्णु पंक्तियों में रोपण, फसल चक्र, और टीवाईएलसीवी के प्रतिरोध के लिए प्रजनन शामिल हैं। कई अन्य पादप विषाणुओं की तरह, TYLCV को नियंत्रित करने के लिए सबसे आशाजनक तरीकों में से एक TYLCV के प्रतिरोधी ट्रांसजेनिक टमाटर पौधों का उत्पादन है।"
  },
  "Tomato___Tomato_mosaic_virus": {
    "en": " <b>Crop</b>: Tomato <br/>Disease: Mosaic Virus<br/>\n        <br/> Cause of disease:\n\n        <br/><br/> 1. Tomato mosaic virus and tobacco mosaic virus can exist for two years in dry soil or leaf debris, but will only persist one month if soil is moist. The viruses can also survive in infected root debris in the soil for up to two years.\n\n        <br/> 2. Seed can be infected and pass the virus to the plant but the disease is usually introduced and spread primarily through human activity. The virus can easily spread between plants on workers' hands, tools, and clothes with normal activities such as plant tying, removing of suckers, and harvest \n        <br/> 3. The virus can even survive the tobacco curing process, and can spread from cigarettes and other tobacco products to plant material handled by workers after a cigarette\n\n\n        <br/><br/> How to prevent/cure the disease <br/>\n\n\n        <br/>1. Purchase transplants only from reputable sources. Ask about the sanitation procedures they use to prevent disease.\n\n        <br/>2. Inspect transplants prior to purchase. Choose only transplants showing no clear symptoms.\n        \n        <br/>3. Avoid planting in fields where tomato root debris is present, as the virus can survive long-term in roots.\n        <br/>4. Wash hands with soap and water before and during the handling of plants to reduce potential spread between plants.",
    "hi": " <b>फसल</b>: टमाटर <br/>रोग: मोज़ेक वायरस<br/>\n        <br/> रोग का कारण:\n\n        <br/><br/> 1. टमाटर मोज़ेक वायरस और तंबाकू मोज़ेक वायरस सूखी मिट्टी या पत्ती के मलबे में दो साल तक मौजूद रह सकते हैं, लेकिन अगर मिट्टी नम है तो केवल एक महीने तक ही जीवित रह सकते हैं। वायरस मिट्टी में संक्रमित जड़ के मलबे में भी दो साल तक जीवित रह सकते हैं।\n\n        <br/> 2. बीज संक्रमित हो सकते हैं और वायरस को पौधे तक पहुंचा सकते हैं लेकिन यह बीमारी आमतौर पर मानव गतिविधि के माध्यम से शुरू होती है और फैलती है। वायरस पौधों के बीच श्रमिकों के हाथों, औजारों और कपड़ों पर सामान्य गतिविधियों जैसे पौधों को बांधने, चूसने वालों को हटाने और कटाई के दौरान आसानी से फैल सकता है। \n        <br/> 3. वायरस तम्बाकू इलाज की प्रक्रिया में भी जीवित रह सकता है, और सिगरेट और अन्य तम्बाकू उत्पादों से सिगरेट के बाद श्रमिकों द्वारा संभाले गए पौधों की सामग्री तक फैल सकता है।\n\n\n        <br/><br/> बीमारी को कैसे रोकें/ठीक करें <br/>\n\n\n        <br/>1. प्रत्यारोपण केवल प्रतिष्ठित स्रोतों से ही खरीदें। बीमारी की रोकथाम के लिए उनके द्वारा उपयोग की जाने वाली स्वच्छता प्रक्रियाओं के बारे में पूछें।\n\n        <br/>2. खरीद से पहले प्रत्यारोपण का निरीक्षण करें। केवल ऐसे प्रत्यारोपण चुनें जिनमें कोई स्पष्ट लक्षण न हों।\n        \n        <br/>3. उन खेतों में रोपण से बचें जहां टमाटर की जड़ का मलबा मौजूद है, क्योंकि जड़ों में वायरस लंबे समय तक जीवित रह सकता है।\n        <br/>4. पौधों के बीच संभावित प्रसार को कम करने के लिए पौधों की देखभाल से पहले और दौरान हाथों को साबुन और पानी से धोएं।"
  }
}